## Pair Programming Limieza V
### Modulo 2 Sprint 2
#### Lola Rubio y Judith Mellidez

En este caso trabajaremos con el dataframe que limpiamos en el ejercicio de pair de Limpieza III donde limpiabamos las columnas de species, age, etc. y eliminabamos los outliers. Hoy volveremos a gestionar valores nulos, pero en este caso usaremos los m√©todos de imputaci√≥n de sklearn.

Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming de EDA para dirigir nuestro an√°lisis.

Antes de seguir, recordamos las preguntas que nos planteamos al principio del _pair programming_** de EDA para dirigir nuestro an√°lisis.**

- ¬øEs Australia es el sitio m√°s peligroso y letal para estar relajada en la playa?
- ¬øCu√°l es el rango de edad que sufre la mayor√≠a de los ataques?
- Independientemente de la edad, sufren los hombres m√°s ataques que las mujeres?
- ¬øEn qu√© mes ocurren m√°s ataques?
- ¬øCu√°l es la relaci√≥n entre la especie y el tipo de ataque (si es fatal o no)?
- ¬øC√≥mo han evolucionado los ataques a lo largo del tiempo?

De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no. **Actualizamos esta tabla ya que en el ejercicio de pair de Limpieza I ya dejamos algunas columnas limpitas:

Es el momento de ponernos a trabajar con los valores nulos de nuevo üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos de skelarn intentemos aplicarlos todos. Manos a la obra!

In [31]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
import sidetable 
from sklearn.experimental import enable_iterative_imputer 
from sklearn.impute import IterativeImputer 
from sklearn.impute import SimpleImputer 
from sklearn.impute import KNNImputer

In [48]:
df= pd.read_csv('attacks_limpieza3.csv', index_col=0)
df.head()

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.0,Unprovoked,seychelles,NaN,NaN,NaN,Y,F,Unspecified,NaN
1,1797.05.28.R,1975.0,Unprovoked,NaN,NaN,NaN,May,Y,NaN,Unspecified,NaN
2,1792.09.12,1975.0,Provoked,england,NaN,NaN,Sep,Y,M,Unspecified,NaN
3,1791.00.00,1975.0,Unprovoked,australia,NaN,NaN,NaN,Y,F,Unspecified,NaN
4,1788.05.10,1975.0,Boat,australia,NaN,NaN,May,N,NaN,Unspecified,NaN

In [51]:
df2=df.copy()

In [52]:
df2.head()

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.0,Unprovoked,seychelles,NaN,NaN,NaN,Y,F,Unspecified,NaN
1,1797.05.28.R,1975.0,Unprovoked,NaN,NaN,NaN,May,Y,NaN,Unspecified,NaN
2,1792.09.12,1975.0,Provoked,england,NaN,NaN,Sep,Y,M,Unspecified,NaN
3,1791.00.00,1975.0,Unprovoked,australia,NaN,NaN,NaN,Y,F,Unspecified,NaN
4,1788.05.10,1975.0,Boat,australia,NaN,NaN,May,N,NaN,Unspecified,NaN

#### 1. Es el momento de eliminar los nulos:

- Reemplazad los valores nulos de la columna age por la media de la edad usando el m√©todo SimpleImputer.

In [4]:
#Iniciamos el metodo
imputer=SimpleImputer(strategy='mean',missing_values=np.nan)

In [5]:
#Ajustamos imputer con '.fit' en la columna 'age'
imputer=imputer.fit(df[['age']])

In [14]:
#Rellenamos los valores que faltan con '.transform()'
df['age']=imputer.transform(df[['age']])
df.isnull().sum()

case_number        0
year               0
type               0
country           10
age                0
species_         126
month            154
fatal             96
sex               15
species_shark      0
edad_ataques     177
dtype: int64

In [15]:
df.head()

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.0,Unprovoked,seychelles,27.984249,NaN,NaN,Y,F,Unspecified,NaN
1,1797.05.28.R,1975.0,Unprovoked,NaN,27.984249,NaN,May,Y,NaN,Unspecified,NaN
2,1792.09.12,1975.0,Provoked,england,27.984249,NaN,Sep,Y,M,Unspecified,NaN
3,1791.00.00,1975.0,Unprovoked,australia,27.984249,NaN,NaN,Y,F,Unspecified,NaN
4,1788.05.10,1975.0,Boat,australia,27.984249,NaN,May,N,NaN,Unspecified,NaN

- Reemplazad los valores nulos de la columna sex por la moda, usando el m√©todo SimpleImputer.
üí° Pista üí° La moda en este tipo de aproximaci√≥n se indica como most_frequent.

Procedemos de la misma manera para reemplazar los nulos de la comuna 'sex', trabajando sobre 'df'.

In [26]:
imputer=SimpleImputer(strategy='most_frequent',missing_values=np.nan)

In [27]:
imputer=imputer.fit(df[['sex']])

In [28]:
df['sex']=imputer.transform(df[['sex']])
df.isnull().sum()

case_number        0
year               0
type               0
country           10
age                0
species_         126
month            154
fatal             96
sex                0
species_shark      0
edad_ataques     177
dtype: int64

In [22]:
df['sex'].unique()

array(['F', 'M'], dtype=object)

- Reemplazad los valores nulos de la columna type por el valor m√°s frecuente (la moda) con el m√©todo SimpleImputer.

Procedemos de la misma manera para reemplazar los nulos de la comuna 'type'

In [23]:
imputer=SimpleImputer(strategy='most_frequent',missing_values=np.nan)

In [24]:
imputer=imputer.fit(df[['type']])

In [25]:
df['sex']=imputer.transform(df[['type']])
df.isnull().sum()

case_number        0
year               0
type               0
country           10
age                0
species_         126
month            154
fatal             96
sex                0
species_shark      0
edad_ataques     177
dtype: int64

In [29]:
df['type'].unique()

array(['Unprovoked', 'Provoked', 'Boat', 'Sea Disaster', 'Invalid',
       'Boating'], dtype=object)

- Utilizad el m√©todo KNN Imputer para reemplazar todos los valores nulos de las columnas num√©ricas.

In [30]:
numericas = df.select_dtypes(include = np.number)
numericas

             year        age
0     1975.000000  27.984249
1     1975.000000  27.984249
2     1975.000000  27.984249
3     1975.000000  27.984249
4     1975.000000  27.984249
...           ...        ...
1667  1990.135167  29.000000
1668  1975.000000  19.000000
1669  1975.000000  21.000000
1670  1975.000000  12.000000
1671  1975.000000  35.000000

[1672 rows x 2 columns]

In [33]:
#Iniciamos el metodo KNN IMPUTER
imputerKNN=KNNImputer(n_neighbors=5)
imputerKNN.fit(numericas)

KNNImputer()

In [34]:
#Realizamos el '.transform', nos devuelve un array
numericas_knn=imputerKNN.transform(numericas)

In [35]:
#Convertimos el array anterior a DataFrame
df_KNN_numericas=pd.DataFrame(numericas_knn, columns=numericas.columns)

In [39]:
df_KNN_numericas.sample(7)

        year        age
74    1975.0  27.984249
1236  1984.0  27.000000
185   2018.0  35.000000
156   1975.0  27.984249
1376  1967.0  26.000000
395   2013.0  21.000000
276   2015.0  37.000000

In [46]:
df.head()

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.0,Unprovoked,seychelles,27.984249,NaN,NaN,Y,Unprovoked,Unspecified,NaN
1,1797.05.28.R,1975.0,Unprovoked,NaN,27.984249,NaN,May,Y,Unprovoked,Unspecified,NaN
2,1792.09.12,1975.0,Provoked,england,27.984249,NaN,Sep,Y,Provoked,Unspecified,NaN
3,1791.00.00,1975.0,Unprovoked,australia,27.984249,NaN,NaN,Y,Unprovoked,Unspecified,NaN
4,1788.05.10,1975.0,Boat,australia,27.984249,NaN,May,N,Boat,Unspecified,NaN

- Utilizad el m√©todo Iterative Imputer para reemplazar todos los valores nulos de las columnas num√©ricas.

Procedemos de la misma manera para reemplazar los nulos de las columnas numericas', trabajando sobre 'df2'.

In [53]:
df2.head()

,case_number,year,type,country,age,species_,month,fatal,sex,species_shark,edad_ataques
0,1800.00.00,1975.0,Unprovoked,seychelles,NaN,NaN,NaN,Y,F,Unspecified,NaN
1,1797.05.28.R,1975.0,Unprovoked,NaN,NaN,NaN,May,Y,NaN,Unspecified,NaN
2,1792.09.12,1975.0,Provoked,england,NaN,NaN,Sep,Y,M,Unspecified,NaN
3,1791.00.00,1975.0,Unprovoked,australia,NaN,NaN,NaN,Y,F,Unspecified,NaN
4,1788.05.10,1975.0,Boat,australia,NaN,NaN,May,N,NaN,Unspecified,NaN

In [54]:
df2.isnull().sum()

case_number        0
year               0
type               0
country           10
age              177
species_         126
month            154
fatal             96
sex               15
species_shark      0
edad_ataques     177
dtype: int64

In [57]:
numericas2=df2.select_dtypes(include=np.number)

In [58]:
Imputer=IterativeImputer(n_nearest_features=None, imputation_order='ascending')

In [59]:
imputer.fit(numericas2)

SimpleImputer(strategy='most_frequent')

In [60]:
#Realizamos el '.transform', nos devuelve un array
imputer.transform(numericas2)

array([[1975.,   19.],
       [1975.,   19.],
       [1975.,   19.],
       ...,
       [1975.,   21.],
       [1975.,   12.],
       [1975.,   35.]])

In [61]:
#Convertimos el array anterior a DataFrame
numericas2_trans=pd.DataFrame(imputer.transform(numericas2),columns=numericas2.columns)

In [62]:
numericas2_trans.isnull().sum()

year    0
age     0
dtype: int64

- ¬øPodr√≠ais explicar qu√© diferencia hay entre estos dos √∫ltimos m√©todos?

    - Mediante el metodo IterativeImputer utiliza datos disponibles en otras columnas e itera un numero determinado de veces, pasa una primera vez y evalua, pasa una segunda y vuelve a evaluar y asi sucesivamente. KNN Imputer traves del metodo KNN Imputer mide la distancia tomando el valor medio de los valores mas cercanos.

####  2. Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair

In [65]:
df.to_csv('attacks_limpieza5.csv')